app/Controllers/Admin/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `Minha_user_auth`
WHERE `status` = 'aktif'
SELECT COUNT(*) AS `numrows`
FROM `Minha_mading_comments`
WHERE `Minha_mading_comments`.`deleted_at` IS NULL
---
  public function index()
  {
    // Initialize models
    $userModel = new UserAuthModel();
    $madingModel = new MadingModel();
    $commentModel = new MadingCommentModel();

    // Get user statistics with error handling
    try {
      $userStats = [
        'total_users' => $userModel->countAllResults(),
        'active_users' => $userModel->where('status', 'aktif')->countAllResults(),
        'pending_users' => $userModel->where('status', 'pending')->countAllResults(),
        'inactive_users' => $userModel->where('status', 'nonaktif')->countAllResults(),
      ];
    } catch (\Exception $e) {
      log_message('error', 'Dashboard user stats error: ' . $e->getMessage());
      $userStats = [
        'total_users' => 0,
        'active_users' => 0,
        'pending_users' => 0,
        'inactive_users' => 0,
      ];
    }

    // Get content statistics with error handling
    try {
      $contentStats = [
        'total_mading' => $madingModel->countAllResults(),
        'total_comments' => $commentModel->countAllResults(),
        'chatbot_qa' => 0, // TODO: Implement when chatbot model is ready
      ];