app/Controllers/Admin/Mading.php

  public function listHtml()
  {
    if (!$this->request->isAJAX()) {
      return $this->response->setJSON(['success' => false, 'message' => 'Invalid request']);
    }

    $page = max(1, (int)$this->request->getGet('page'));
    $perPage = min(24, max(3, (int)$this->request->getGet('perPage') ?: 6));
    $offset = ($page - 1) * $perPage;

    $madingModel = new \App\Models\MadingModel();

    // Ambil data mading dengan query yang sama persis seperti user
    $today = date('Y-m-d');
    $builder = $madingModel->db->table('mading_online')
      ->select('mading_online.*, auth_admin.username')
      ->join('auth_admin', 'auth_admin.id = mading_online.admin_id', 'left')
      ->where('mading_online.status', 'aktif')
      ->where('mading_online.tgl_akhir >=', $today)
      ->orderBy('mading_online.created_at', 'DESC');

    $total = $builder->countAllResults(false);
    $rows = $builder->get($perPage, $offset)->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `Minha_mading_online`
LEFT JOIN `Minha_auth_admin` ON `Minha_auth_admin`.`id` = `Minha_mading_online`.`admin_id`
WHERE `Minha_mading_online`.`status` = 'aktif'
AND `Minha_mading_online`.`tgl_akhir` >= '2025-10-14'
SELECT `Minha_mading_online`.*, `Minha_auth_admin`.`username`
FROM `Minha_mading_online`
LEFT JOIN `Minha_auth_admin` ON `Minha_auth_admin`.`id` = `Minha_mading_online`.`admin_id`
WHERE `Minha_mading_online`.`status` = 'aktif'
AND `Minha_mading_online`.`tgl_akhir` >= '2025-10-14'
ORDER BY `Minha_mading_online`.`created_at` DESC
 LIMIT 6, 6