app/Controllers/Admin/MasterData.php


    // Get users with pagination
    $orderCol = $columnMap[$sortBy] ?? 'user_auth.created_at';
    $users = $dataBuilder->orderBy($orderCol, $sortDir)
      ->limit($perPage, ($page - 1) * $perPage)
      ->get()
      ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `Minha_user_auth`
SELECT *
FROM `Minha_user_auth`
ORDER BY `Minha_user_auth`.`created_at` DESC
 LIMIT 10


    // Get layanan with pagination
    $orderCol = $columnMap[$sortBy] ?? 'layanan_informasi.created_at';
    $layanan = $dataBuilder->orderBy($orderCol, $sortDir)
      ->limit($perPage, ($page - 1) * $perPage)
      ->get()
      ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `Minha_layanan_informasi`
WHERE kategori IS NOT NULL AND kategori != ""
SELECT *
FROM `Minha_layanan_informasi`
WHERE kategori IS NOT NULL AND kategori != ""
AND kategori IS NOT NULL AND kategori != ""
ORDER BY `Minha_layanan_informasi`.`created_at` DESC
 LIMIT 10