app/Controllers/Admin/Reports.php

SELECT COUNT(*) AS `numrows`
FROM `Minha_mading_comments`
LEFT JOIN `Minha_user_auth` ON `Minha_user_auth`.`id` = `Minha_mading_comments`.`user_id`
LEFT JOIN `Minha_mading_online` ON `Minha_mading_online`.`id` = `Minha_mading_comments`.`mading_id`
WHERE `Minha_mading_comments`.`user_type` = 'user'
AND `Minha_mading_comments`.`deleted_at` IS NULL
SELECT `Minha_mading_comments`.*, `Minha_user_auth`.`namalengkap`, `Minha_user_auth`.`foto_profil`, `Minha_mading_online`.`judul` as `mading_judul`
FROM `Minha_mading_comments`
LEFT JOIN `Minha_user_auth` ON `Minha_user_auth`.`id` = `Minha_mading_comments`.`user_id`
LEFT JOIN `Minha_mading_online` ON `Minha_mading_online`.`id` = `Minha_mading_comments`.`mading_id`
WHERE `Minha_mading_comments`.`user_type` = 'user'
AND `Minha_mading_comments`.`deleted_at` IS NULL
ORDER BY `Minha_mading_comments`.`created_at` DESC
 LIMIT 10
---
  public function index()
  {
    try {
      // Pagination params
      $pc = max(1, (int) ($this->request->getGet('pc') ?? 1)); // page comments
      $pm = max(1, (int) ($this->request->getGet('pm') ?? 1)); // page mading
      $perComments = max(1, (int) ($this->request->getGet('ppc') ?? 10));
      $perMading   = max(1, (int) ($this->request->getGet('ppm') ?? 10));

      // Ambil semua komentar utama (hanya user) dengan data user dan mading
      $commentsBuilder = $this->commentModel->select('mading_comments.*, user_auth.namalengkap, user_auth.foto_profil, mading_online.judul as mading_judul')
        ->join('user_auth', 'user_auth.id = mading_comments.user_id', 'left')
        ->join('mading_online', 'mading_online.id = mading_comments.mading_id', 'left')
        ->where('mading_comments.user_type', 'user');

      // Total untuk pagination
      $totalComments = (clone $commentsBuilder)->countAllResults(false);

      // Data halaman ini
      $comments = $commentsBuilder
        ->orderBy('mading_comments.created_at', 'DESC')
        ->limit($perComments, ($pc - 1) * $perComments)
        ->get()->getResultArray();