app/Controllers/UserController/UCDashboard.php

SELECT COUNT(*) AS `numrows`
FROM `Minha_mading_likes`
WHERE `user_id` = '2'
SELECT COUNT(*) AS `numrows`
FROM `Minha_mading_comments`
WHERE `user_id` = '2'
AND `Minha_mading_comments`.`deleted_at` IS NULL
---
    public function indexHome()
    {
        $madingModel = new MadingModel();
        $likeModel = new MadingLikeModel();
        $commentModel = new MadingCommentModel();
        $layananModel = new LayananModel();

        // Overview stats untuk user
        try {
            $stats = [
                'mading_active' => $madingModel->where('status', 'aktif')->countAllResults(),
                'my_likes' => ($likeModel->where('user_id', session('user_id'))->countAllResults()),
                'my_comments' => ($commentModel->where('user_id', session('user_id'))->countAllResults()),