app/Controllers/UserController/UCNotifications.php

SELECT COUNT(*) AS `numrows`
FROM `Minha_mading_comments` `child`
JOIN `Minha_mading_comments` `parent` ON `parent`.`id` = `child`.`parent_id`
WHERE `parent`.`user_id` = 1
AND (parent.user_type IS NULL OR parent.user_type != "admin")
AND NOT EXISTS (SELECT 1 FROM Minha_notif_dismissed nd WHERE nd.user_id = 1 AND nd.comment_id = child.id)
AND NOT EXISTS (SELECT 1 FROM Minha_notif_seen ns WHERE ns.user_id = 1 AND ns.comment_id = child.id)
---
  public function count()
  {
    if (!$this->request->is('get')) {
      return $this->response->setStatusCode(405)->setJSON(['message' => 'Metode tidak diizinkan']);
    }
    $userId = (int) session('user_id');
    if (!$userId) {
      return $this->response->setStatusCode(401)->setJSON(['message' => 'Unauthorized']);
    }
    $db = \Config\Database::connect();
    $dismissedTable = $db->prefixTable('notif_dismissed');
    $seenTable = $db->prefixTable('notif_seen');
    $builder = $db->table('mading_comments child')
      ->join('mading_comments parent', 'parent.id = child.parent_id')
      ->where('parent.user_id', $userId)
      ->where('(parent.user_type IS NULL OR parent.user_type != "admin")', null, false) // Hanya komentar user, bukan admin
      ->where("NOT EXISTS (SELECT 1 FROM {$dismissedTable} nd WHERE nd.user_id = {$userId} AND nd.comment_id = child.id)", null, false)
      ->where("NOT EXISTS (SELECT 1 FROM {$seenTable} ns WHERE ns.user_id = {$userId} AND ns.comment_id = child.id)", null, false);
    $cnt = $builder->countAllResults();