app/Controllers/UserController/UCProfile.php

    public function index()
    {
        $userId = (int) session('user_id');
        if (!$userId) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
        }

        $user = (new UserAuthModel())
            ->select('id, namalengkap, jurusan, npm, status, bio, foto_profil, created_at')
            ->find($userId);
---
SELECT `id`, `namalengkap`, `jurusan`, `npm`, `status`, `bio`, `foto_profil`, `created_at`
FROM `Minha_user_auth`
WHERE `Minha_user_auth`.`id` = 1