app/Controllers/AuthController.php

    public function doLogin()
    {
        $model = new UserAuthModel();

        // Validasi input
        $rules = [
            'npm'      => 'required|min_length[10]|numeric',
            'password' => 'required|min_length[6]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('error', 'NPM atau password salah.');
        }

        $npm = $this->request->getPost('npm');
        $password = $this->request->getPost('password');

        // Cari user
        $user = $model->where('npm', $npm)->first();
---
SELECT *
FROM `Minha_user_auth`
WHERE `npm` = '2021020109'
 LIMIT 1