app/Models/MadingCommentModel.php

    public function getAllByMadingWithUser(int $madingId): array
    {
        $db = \Config\Database::connect();

        // Ambil semua komentar untuk mading ini
        $comments = $this->where('mading_id', $madingId)
            ->orderBy('created_at', 'DESC')
            ->findAll();

        $result = [];

        foreach ($comments as $comment) {
            $userId = $comment['user_id'];
            $userType = $comment['user_type'] ?? 'user'; // Default untuk data lama

            // Gunakan kolom user_type untuk membedakan
            if ($userType === 'admin') {
                // Ambil data admin
                $userData = $db->table('auth_admin')
                    ->select('username as namalengkap, NULL as foto_profil')
                    ->where('id', $userId)
                    ->get()
                    ->getRowArray();
---
SELECT *
FROM `Minha_mading_comments`
WHERE `mading_id` = 3
AND `Minha_mading_comments`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
SELECT `username` as `namalengkap`, NULL as foto_profil
FROM `Minha_auth_admin`
WHERE `id` = '1'

                }
            } else {
                // Ambil data user
                $userData = $db->table('user_auth')
                    ->select('namalengkap, foto_profil')
                    ->where('id', $userId)
                    ->get()
                    ->getRowArray();
---
SELECT `namalengkap`, `foto_profil`
FROM `Minha_user_auth`
WHERE `id` = '1'