app/Models/MadingModel.php

    private function enrichMadingData(array $madingList): array
    {
        $likeModel = new \App\Models\MadingLikeModel();
        $commentModel = new \App\Models\MadingCommentModel();

        foreach ($madingList as &$mading) {
            // Pastikan views tidak null
            $mading['views'] = $mading['views'] ?? 0;

            // Hitung likes
            $mading['total_likes'] = $likeModel->getTotalLikes($mading['id']);

            // Hitung komentar
            $mading['total_comments'] = $commentModel->where('mading_id', $mading['id'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `Minha_mading_comments`
WHERE `mading_id` = '11'
AND `Minha_mading_comments`.`deleted_at` IS NULL

    public function getLatest($limit = 3)
    {
        $today = date('Y-m-d');
        $cacheKey = "mading_latest_{$limit}_{$today}";

        return $this->getCache()->remember($cacheKey, 300, function () use ($limit, $today) {
            // Pastikan yang kadaluarsa dinonaktifkan
            $this->archiveExpired();

            return $this->select('mading_online.*, auth_admin.username')
                ->join('auth_admin', 'auth_admin.id = mading_online.admin_id', 'left')
                ->where('mading_online.status', 'aktif')
                ->where('mading_online.tgl_akhir >=', $today)
                ->orderBy('mading_online.created_at', 'DESC')
                ->limit($limit)
                ->findAll();
---
SELECT `Minha_mading_online`.*, `Minha_auth_admin`.`username`
FROM `Minha_mading_online`
LEFT JOIN `Minha_auth_admin` ON `Minha_auth_admin`.`id` = `Minha_mading_online`.`admin_id`
WHERE `Minha_mading_online`.`status` = 'aktif'
AND `Minha_mading_online`.`tgl_akhir` >= '2025-10-15'
ORDER BY `Minha_mading_online`.`created_at` DESC
 LIMIT 3