app/Models/MadingLikeModel.php

SELECT COUNT(*) AS `numrows`
FROM `Minha_mading_likes`
WHERE `mading_id` = '11'
---
    public function getTotalLikes($madingId)
    {
        return $this->where('mading_id', $madingId)->countAllResults();